Repository: Jonathan-Llopis/Roll_and_Reserve_App
Catalog: lib/l10n/app_*.arb
Languages: ca, es

source: Accept
ca: Acceptar
es: Aceptar

source: Cancel
ca: Cancel·lar
es: Cancelar

source: Edit Shop
ca: Editar Botiga
es: Editar Tienda

# shop_name
source: Shop {shopName}
ca: Botiga {shopName}
es: Tienda {shopName}

# shop_direction
source: Shop Address
ca: Adreça de la Botiga
es: Dirección de la Tienda

# shop_delete
source: Delete Shop
ca: Eliminar Botiga
es: Eliminar Tienda

# add_profile_image
source: Add a profile image
ca: Afegir una imatge de perfil
es: Añadir una imagen de perfil

source: Camera
ca: Càmera
es: Cámara

source: Gallery
ca: Galeria
es: Galería

source: Login to continue
ca: Inicia sessió per continuar
es: Iniciar sesión para continuar

source: Email
ca: Correu Electrònic
es: Correo Electrónico

source: Password
ca: Contrasenya
es: Contraseña

source: Please enter your password
ca: Si us plau, introdueix la teva contrasenya
es: Por favor, introduce tu contraseña

source: You forgot your password?
ca: Has oblidat la teva contrasenya?
es: ¿Olvidaste tu contraseña?

source: Don't have an account? Register here
ca: No tens un compte? Registra't aquí
es: ¿No tienes una cuenta? Regístrate aquí

source: Sign in to continue
ca: Inicia sessió per continuar
es: Inicia sesión para continuar

source: Username
ca: Nom d'Usuari
es: Nombre de Usuario

source: Name
ca: Nom
es: Nombre

source: Confirmation Password
ca: Confirmar Contrasenya
es: Confirmar Contraseña

# table_number
source: Table: {tableNumber}
ca: Taula: {tableNumber}
es: Mesa: {tableNumber}

source: Available Reservations
ca: Reserves Disponibles
es: Reservas Disponibles

source: Filter by date
ca: Filtrar per data
es: Filtrar por fecha

source: Available Reservations for: {date}
ca: Reserves Disponibles per a: {date}
es: Reservas Disponibles para: {date}

source: Shop Reviews
ca: Resenyes de la Botiga
es: Reseñas de la Tienda

source: Rating
ca: Valoració
es: Calificación

source: All Reviews
ca: Totes les Resenyes
es: Todas las Reseñas

source: Available Tables:
ca: Taules disponibles:
es: Mesas disponibles:

source: Save
ca: Desar
es: Guardar

source: Google Login
ca: Iniciar sessió amb Google
es: Iniciar sesión con Google

source: Login
ca: Iniciar Sessió
es: Iniciar Sesión

# email_or_username_exists
source: The email or username already exists in the database
ca: El correu electrònic o nom d'usuari ja existeix a la base de dades
es: El correo electrónico o nombre de usuario ya existe en la base de datos

source: Register
ca: Registrar-se
es: Registrarse

source: Update
ca: Actualitzar
es: Actualitzar

# reserve_day
source: Reserve day: {dayDate}
ca: Reserva dia: {dayDate}
es: Reserva día: {dayDate}

# game_description
source: Game: {gameDescription}
ca: Joc: {gameDescription}
es: Juego: {gameDescription}

# total_players_at_table
source: Total players at table: {currentPlayers} of {totalPlaces}
ca: Total de jugadors a la taula: {currentPlayers} de {totalPlaces}
es: Total de jugadores en mesa: {currentPlayers} de {totalPlaces}

source: Start time:
ca: Hora d'inici
es: Hora de inicio:

source: End time:
ca: Hora de finalització:
es: Hora de fin:

source: Anonymous
ca: Anònim
es: Anónimo

source: Total Seats at Table
ca: Places Totals a la Taula
es: Plazas Totales en Mesa

source: Start time (HH:MM)
ca: Hora d'inici (HH:MM)
es: Hora de inicio (HH:MM)

source: End time (HH:MM)
ca: Hora de finalització (HH:MM)
es: Hora de fin (HH:MM)

source: Description
ca: Descripció
es: Descripción

source: Required Material
ca: Material Necessari
es: Material Necesario

source: Difficulty
ca: Dificultat
es: Dificultad

source: Game Category
ca: Categoria de Joc
es: Categoría de Juego

source: Game
ca: Joc
es: Juego

source: Add Review
ca: Afegir Resenya
es: Añadir Reseña

source: Please write a description
ca: Si us plau, escriu una descripció
es: Por favor, escribe una descripción

source: Create New Table
ca: Crear Nova Taula
es: Crear Nueva Mesa

source: Edit Table
ca: Editar Taula
es: Editar Mesa

# table_number_text
source: Table Number
ca: Número de la Taula
es: Número de la Mesa

source: Delete Table
ca: Eliminar Taula
es: Eliminar Mesa

source: Manage Reservations
ca: Gestionar Reserves
es: Gestionar Reservas

# confirm_delete_shop
source: Are you sure you want to delete the shop?
ca: Estàs segur que vols eliminar la botiga?
es: ¿Estás seguro que quieres eliminar la tienda?

# email_sent_reset_password
source: An email has been sent to your email to reset your password
ca: S'ha enviat un correu al teu email per restablir la teva contrasenya
es: Se ha enviado un correo a tu email para restablecer tu contraseña

source: User Logout
ca: Tancar Sessió
es: Cerrar Sesión

# confirm_logout
source: Are you sure you want to log out of the application?
ca: Estàs segur que vols sortir de l'aplicació?
es: ¿Estás seguro que quieres salir de la aplicación?

source: Reset Password
ca: Recuperar Contrasenya
es: Recuperar Contraseña

# enter_your_email_to_reset_password
source: Enter your email to reset your password
ca: Introdueix el teu email per restablir la teva contrasenya
es: Introduce tu email para restablecer tu contraseña

source: Change Password
ca: Canviar Contrasenya
es: Cambiar Contraseña

source: Current Password
ca: Contrasenya Actual
es: Contraseña Actual

source: New Password
ca: Nova Contrasenya
es: Nueva Contraseña

source: User Settings
ca: Configuració de l'Usuari
es: Ajustes del Usuario

# confirm_delete_table
source: Are you sure you want to delete the table?
ca: Estàs segur que vols eliminar la taula?
es: ¿Estás seguro que quieres eliminar la mesa?

# active_game
source: Active game: {gameId}
ca: Joc actiu: {gameId}
es: Juego activo: {gameId}

source: Schedule:
ca: Horari:
es: Horario:

# day_schedule
source: Day: {dayDate} {startTime} - {endTime}
ca: Dia: {dayDate} {startTime} - {endTime}
es: Día: {dayDate} {startTime} - {endTime}

# free_places
source: {freePlaces} free places
ca: {freePlaces} llocs lliures
es: {freePlaces} lugares libres

source: Additional Information:
ca: Informació addicional:
es: Información adicional:

source: Exit
ca: Sortir
es: Salir

source: Join
ca: Unir-se
es: Unirse

source: Edit Tables
ca: Editar Taules
es: Editar Mesas

# total_tables
source: Total Tables: {totalTables}
ca: Total de Taules: {totalTables}
es: Total de Mesas: {totalTables}

# reservations
source: Reservations: {reservationsCount}
ca: Reserves: {reservationsCount}
es: Reservas: {reservationsCount}

# welcome_user
source: Welcome {username}!
ca: Benvingut {username}!
es: Bienvenido {username}!

# all_available_shops
source: These are all the available shops.
ca: Aquestes són totes les botigues disponibles.
es: Estas son todas las tiendas disponibles.

source: Shops registered in your name:
ca: Botigues registrades al teu nom:
es: Tiendas registradas a tu nombre:

# no_shops
source: You have no shops
ca: No tens botigues
es: No tienes tiendas

source: Remove Filters
ca: Eliminar Filtres
es: Eliminar Filtros

source: Filter
ca: Filtrar
es: Filtrar

source: Filter Free Tables
ca: Filtrar Taules Lliures
es: Filtrar Mesas Libres

source: Find your game table
ca: Troba la teva taula de joc
es: Encuentra tu mesa de juego

source: Home
ca: Inici
es: Inicio

source: Settings
ca: Configuració
es: Configuración

source: Help
ca: Ajuda
es: Ayuda

source: Logout
ca: Tancar Sessió
es: Cerrar Sesión

# shop_name_text
source: Shop Name
ca: Nom de la botiga
es: Nombre de la tienda

source: Shop Location
ca: Localització de la botiga
es: Localidad de la tienda

source: Error loading reservations
ca: Error al carregar reserves
es: Error al cargar reservas

source: Date
ca: Data
es: Fecha

source: Start time must be less than end time
ca: L'hora d'inici ha de ser menor que l'hora de finalització
es: La hora de inicio debe ser menor que la de fin

source: End time must be greater than start time
ca: L'hora de finalització ha de ser major que l'hora d'inici
es: La hora de fin debe ser mayor que la de inicio

# time_already_taken_that_day
source: The time is already taken that day
ca: L'hora ja està ocupada aquell dia
es: La hora ya está cogida ese día

source: Required field
ca: Camp obligatori
es: Campo obligatorio

source: Must be a number
ca: Ha de ser un número
es: Debe ser un número

# format_must_be_hh_mm
source: The format must be HH:MM
ca: El format ha de ser HH:MM
es: El formato debe ser HH:MM

# name_already_in_use
source: The name is already in use.
ca: El nom ja està en ús.
es: El nombre ya está en uso.

# email_already_in_use
source: The email is already in use.
ca: El correu electrònic ja està en ús.
es: El email ya está en uso.

# password_must_be_at_least_8_characters
source: The password must be at least 8 characters long
ca: La contrasenya ha de tenir almenys 8 caràcters
es: La contraseña debe tener al menos 8 caracteres

# password_must_contain_at_least_one_number
source: The password must contain at least one number
ca: La contrasenya ha de contenir almenys un número
es: La contraseña debe contener al menos un número

# password_must_contain_at_least_one_uppercase_letter
source: The password must contain at least one uppercase letter
ca: La contrasenya ha de contenir almenys una lletra majúscula
es: La contraseña debe contener al menos una letra mayúscula

# password_must_contain_at_least_one_lowercase_letter
source: The password must contain at least one lowercase letter
ca: La contrasenya ha de contenir almenys una lletra minúscula
es: La contraseña debe contener al menos una letra minúscula

# passwords_do_not_match
source: The passwords do not match
ca: Les contrasenyes no coincideixen
es: Las contraseñas no coinciden

# password_is_incorrect
source: The password is incorrect
ca: La contrasenya no és correcta
es: La contraseña no es correcta

# error_validating_password
source: Error validating the password
ca: Error al validar la contrasenya
es: Error al validar la contraseña

# table_number_already_exists
source: The table number already exists
ca: El número de taula ja existeix
es: El número de mesa ya existe

source: Players
ca: Jugadors
es: Jugadores

source: Email Invalid
ca: Correu Electrònic Invàlid
es: Correo Electrónico Inválido

source: Change Language
ca: Canviar d'idioma
es: Cambiar Idioma

source: Go to Events
ca: Anar als Esdeveniments
es: Ir a los Eventos

source: Events
ca: Esdeveniments
es: Eventos

source: Your Reservations
ca: Les Teves Reserves
es: Tus Reservas

# select_tables_to_occupy
source: Select the tables to occupy
ca: Selecciona les taules per ocupar
es: Selecciona las mesas para ocupar

# select_start_date
source: Select the start date of the event
ca: Selecciona la data d'inici de l'esdeveniment
es: Selecciona la fecha de inicio del evento

source: Start date not selected
ca: Data d'inici no seleccionada
es: Fecha de inicio no seleccionada

source: Start time not selected
ca: Hora d'inici no seleccionada
es: Hora de inicio no seleccionada

# select_end_date
source: Select the end date of the event
ca: Selecciona la data de finalització de l'esdeveniment
es: Selecciona la fecha de finalización del evento

source: End date not selected
ca: Data de finalització no seleccionada
es: Fecha de finalización no seleccionada

# end_date_before_start_date
source: End date cannot be before start date
ca: La data de finalització no pot ser anterior a la data d'inici
es: La fecha de finalización no puede ser anterior a la fecha de inicio

# event_same_day
source: The event must be on the same day
ca: L'esdeveniment ha de ser el mateix dia
es: El evento debe ser el mismo día

source: End time not selected
ca: Hora de finalització no seleccionada
es: Hora de finalización no seleccionada

# game_session_not_started
source: The game session has not started yet
ca: La sessió de joc encara no ha començat
es: La sesión de juego aún no ha comenzado

source: Wrong reservation table
ca: Taula de reserva incorrecta
es: Mesa de reserva incorrecta

source: Scan Again
ca: Escanejar de Nou
es: Escanear de Nuevo

source: Grant camera permission
ca: Concedir permís de càmera
es: Conceder permiso de cámara

# location_service_disabled
source: Location service is disabled.
ca: El servei de localització està desactivat.
es: El servicio de localización está desactivado.

# location_permission_denied
source: Location permissions are denied.
ca: Els permisos de localització estan denegats.
es: Los permisos de localización están denegados.

# location_permission_denied_permanently
source: Location permissions are permanently denied.
ca: Els permisos de localització estan denegats permanentment.
es: Los permisos de localización están denegados permanentemente.

# reservation_confirmed
source: Your reservation has been confirmed!
ca: La teva reserva ha estat confirmada!
es: ¡Tu reserva ha sido confirmada!

# not_in_shop_location
source: You are not in the shop location
ca: No estàs a la ubicació de la botiga
es: No estás en la ubicación de la tienda

# game_event
source: Game Event: {gameEvent}
ca: Esdeveniment de Joc: {gameEvent}
es: Evento de Juego: {gameEvent}

source: Event: {dayDate}
ca: Esdeveniment: {dayDate}
es: Evento: {dayDate}

# reserva_confirmada
source: Reservation Confirmed
ca: Reserva Confirmada
es: Reserva Confirmada

# select_your_location_on_map
source: Select your location on the map:
ca: Selecciona la teva ubicació al mapa:
es: Selecciona tu ubicación en el mapa:

source: Store Events
ca: Esdeveniments de la Botiga
es: Eventos de la Tienda

source: Confirm
ca: Confirmar
es: Confirmar

source: English
ca: Anglès
es: Inglés

source: Spanish
ca: Espanyol
es: Español

source: French
ca: Francès
es: Francés

source: Catalan
ca: Català
es: Catalán

source: Month
ca: Mes
es: Mes

source: Quarter
ca: Trimestre
es: Trimestre

source: Annual
ca: Anual
es: Anual

# total_reservations
source: Total Reserves
es: Reservas Totales

source: Active Players
ca: Jugadors Actius
es: Jugadores Activos

source: Peak Hours
ca: Hores Punta
es: Horas Pico

source: Popular Games
ca: Jocs Populars
es: Juegos Populares

# total_reservations_by_period
source: Total Reservations for {selectedPeriod}
ca: Total de Reserves per {selectedPeriod}
es: Reservas Totales para {selectedPeriod}

# active_players_by_period
source: Active Players for {selectedPeriod}
ca: Jugadors Actius per {selectedPeriod}
es: Jugadores Activos para {selectedPeriod}

source: Peak Reservation Hours
ca: Hores Punta de Reserves
es: Horas Pico de Reservas

source: Most Popular Games
ca: Jocs Més Populars
es: Juegos Más Populares

source: Games
ca: Jocs
es: Juegos

source: Ask AI about rules
ca: Pregunta a la IA sobre les regles
es: Pregunta a la IA sobre las reglas

# send_message
source: Send a message
ca: Enviar un missatge
es: Enviar un mensaje

source: Loading chat...
ca: Carregant el xat...
es: Cargando chat...

source: User or password incorrect
ca: Usuari o contrasenya incorrecta
es: Usuario o contraseña incorrectos

source: Nearby Shops
ca: Botigues Properes
es: Tiendas Cercanas

source: Go to Shop
ca: Anar a la Botiga
es: Ir a la Tienda

source: Confirmed
ca: Confirmat
es: Confirmado

source: Pending
ca: Pendent
es: Pendiente

source: Loading...
ca: Carregant...
es: Cargando...

source: Unsubscribed
ca: Desubscrit
es: Dado de baja

source: Subscribed
ca: Subscrit
es: Suscrito

source: Latest Players
ca: Últims Jugadors
es: Últimos Jugadores

source: Store Statistics
ca: Estadístiques de la Botiga
es: Estadísticas de la Tienda

source: Seats
ca: Seients
es: Asientos

# store_map
source: Stores Map
ca: Mapa de les Botiges
es: Mapa de las Tiendas

source: Your Reviews
ca: Les Teves Resenyes
es: Tus Reseñas

source: Chat with AI
ca: Xateja amb la IA
es: Chat con IA

source: Processing Code
ca: Processant codi
es: Procesando código

source: Align QR Code
ca: Alinea el codi QR
es: Alinear código QR

source: Error Processing Code
ca: Error en processar el codi
es: Error al procesar el código

source: Edit Info.
ca: Editar Info.
es: Editar Info.

source: Received Reviews
ca: Resenyes Rebudes
es: Reseñas Recibidas

source: Played with
ca: Jugat amb
es: Jugado con

# welcome_to_roll_and_reserve
source: Welcome to Roll & Reserve, {name}!
ca: Benvingut a Roll & Reserve, {name}!
es: Bienvenido a Roll & Reserve, {name}!

# find_your_ideal_game_table
source: Find your ideal game table and reserve in seconds.
ca: Troba la teva taula de joc ideal i reserva en segons.
es: Encuentra tu mesa de juego ideal y reserva en segundos.

# discover_nearby_shops
source: Discover shops near you
ca: Descobreix botigues properes
es: Descubre tiendas cercanas

# explore_shops_with_tables
source: Explore shops with available tables and community ratings
ca: Explora botigues amb taules disponibles i valoracions de la comunitat
es: Explora tiendas con mesas disponibles y valoraciones de la comunidad

# reserve_in_few_steps
source: Reserve in a few steps
ca: Reserva en pocs passos
es: Reserva en pocos pasos

# select_date_time_materials
source: Select date, time, and necessary materials for your game
ca: Selecciona data, hora i materials necessaris per al teu joc
es: Selecciona fecha, hora y materiales necesarios para tu juego

source: Manage your experience
ca: Gestiona la teva experiència
es: Gestiona tu experiencia

# control_reservations_reviews_settings
source: Control your reservations, reviews, and settings from one place. Now you can even ask the AI your questions.
ca: Controla les teves reserves, resenyes i configuracions des d'un sol lloc. Ara també pots preguntar a la IA les teves qüestions.
es: Controla tus reservas, reseñas y ajustes desde un solo lugar. Ahora incluso puedes preguntar a la IA tus dudas.

source: Skip
ca: Saltar
es: Saltar

source: Get Started
ca: Començar
es: Comenzar

# welcome_store_owner
source: Welcome {name}, Store Owner!
ca: Benvingut {name}, Propietari de Botiga!
es: Bienvenido {name}, Propietario de Tienda!

# manage_your_game_space
source: Manage your game space professionally and efficiently
ca: Gestiona el teu espai de joc de manera professional i eficient
es: Gestiona tu espacio de juego de forma profesional y eficiente

source: Set Up Your Store
ca: Configura la teva Botiga
es: Configura tu tienda

# add_location_and_details
source: Add location and details of your establishment
ca: Afegeix la ubicació i els detalls del teu establiment
es: Añade la ubicación y detalles de tu establecimiento

source: Manage Tables
ca: Gestiona Taules
es: Gestionar Mesas

# create_and_edit_tables
source: Create and edit available tables Manage capacities and special features
ca: Crea i edita taules disponibles Gestiona capacitats i característiques especials
es: Crea y edita mesas disponibles Gestiona capacidades y características especiales

source: Schedule Events
ca: Programa Esdeveniments
es: Programar Eventos

# organize_tournaments_and_activities
source: Organize tournaments and special activities Control capacities and reservations
ca: Organitza tornejos i activitats especials Controla capacitats i reserves
es: Organiza torneos y actividades especiales Controla capacidades y reservas

source: Analyze and Improve
ca: Analitza i Millora
es: Analizar y Mejorar

# monitor_reservations_reviews_statistics
source: Monitor reservations, reviews, and statistics Make data-driven decisions
ca: Supervisa reserves, resenyes i estadístiques Pren decisions basades en dades
es: Monitorea reservas, reseñas y estadísticas Toma decisiones basadas en datos

source: Go to Home
ca: Anar a Inici
es: Ir a Inicio

# role_admin
source: Admin
ca: Administrador
es: Administrador

# role_user
source: User
ca: Usuari
es: Usuario

# role_owner
source: Owner
ca: Propietari
es: Propietario

source: Role
ca: Rol
es: Rol

# error_select_user
source: Error selecting user
ca: Error seleccionant usuari
es: Error al seleccionar usuario

source: Select User
ca: Selecciona Usuari
es: Seleccionar Usuario

# all_users
source: These are all the users
ca: Aquests són tots els usuaris
es: Estos son todos los usuarios

# all_shops
source: These are all the shops
ca: Aquestes són totes les botigues
es: Estas son todas las tiendas

source: AI Assistant
ca: Assistent IA
es: Asistente de IA

source: You
ca: Tu
es: Tú

source: Restart Conversation
ca: Reiniciar Conversa
es: Reiniciar Conversación

source: Locating you...
ca: Localitzant-te...
es: Localizándote...

source: Retry
ca: Reintentar
es: Reintentar

# tap_marker_info
source: Tap on a marker for more information
ca: Toca un marcador per a més informació
es: Toca un marcador para más información

source: Play Role with AI
ca: Jugar Rol amb IA
es: Jugar Rol con IA

# choose_world_adventure
source: Choose the world where you want to live your adventure
ca: Tria el món on vols viure la teva aventura
es: Elige el mundo donde quieres vivir tu aventura

source: Describe Your Adventure
es: Describe tu aventura

source: Enter Adventurers Description
es: Introduce la descripción de los aventureros

source: Adventurers Description
es: Descripción de los aventureros

source: Start Game
ca: Començar Joc
es: Comenzar Juego

# confirm_delete_adventure
source: Are you sure you want to delete this adventure? This action cannot be undone.
es: ¿Estás seguro de que deseas eliminar esta aventura? Esta acción no se puede deshacer.

source: Delete Adventure
es: Eliminar Aventura

source: Error: Character data incomplete or null.
es: Error: Datos del personaje incompletos o nulos.

source: Primary Attributes
es: Atributos Primarios

source: Health and Defense
es: Salud y Defensa

source: Magical Skills
es: Habilidades Mágicas

source: Equipment and Treasure
es: Equipo y Tesoro

source: Companion
es: Compañero

source: Strength
es: Fuerza

source: Dexterity
es: Destreza

source: Constitution
es: Constitución

source: Intelligence
es: Inteligencia

source: Wisdom
es: Sabiduría

source: Charisma
es: Carisma

source: Level
es: Nivel

source: Known Spells
es: Hechizos Conocidos

source: Cantrips
es: Trucos

source: Level 1 Spell Slots:
es: Ranuras de Hechizos de Nivel 1:

# setting_description
source: Describe the setting of your adventure
es: Describe el escenario de tu aventura

# ask_about_rules
source: Ask your questions about the rules
es: Pregunta tus dudas sobre las reglas

source: Identify board games
es: Identificar juegos de mesa
